IlleniumDillon/MM32LLD/MM32/Sfr/MM32_TIM_3_4_Reg.h
/*
 * @Author: IlleniumDillon 147900130@qq.com
 * @Date: 2022-11-02 20:59:21
 * @LastEditors: IlleniumDillon 147900130@qq.com
 * @LastEditTime: 2022-12-14 11:12:04
 * @FilePath: \CODE\MM32\Sfr\MM32_TIM_3_4_Reg.h
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
#ifndef _MM32_TIM_3_4_REG_H_
#define _MM32_TIM_3_4_REG_H_

#include "MM32_RegBase.h"

#include "MM32_TIM_3_4_RegDef.h"

#define MOUDLE_TIM3		((MM32_TIM_3_4*)TIM3_BASE)

#define MOUDLE_TIM4		((MM32_TIM_3_4*)TIM4_BASE)

#define TIM3_CR1		((MM32_TIM_3_4_CR1*)(TIM3_BASE+0X00))

#define TIM3_CR2		((MM32_TIM_3_4_CR2*)(TIM3_BASE+0X04))

#define TIM3_SMCR		((MM32_TIM_3_4_SMCR*)(TIM3_BASE+0X08))

#define TIM3_DIER		((MM32_TIM_3_4_DIER*)(TIM3_BASE+0X0C))

#define TIM3_SR		((MM32_TIM_3_4_SR*)(TIM3_BASE+0X10))

#define TIM3_EGR		((MM32_TIM_3_4_EGR*)(TIM3_BASE+0X14))

#define TIM3_CCMR1		((MM32_TIM_3_4_CCMR1*)(TIM3_BASE+0X18))

#define TIM3_CCMR2		((MM32_TIM_3_4_CCMR2*)(TIM3_BASE+0X1C))

#define TIM3_CCER		((MM32_TIM_3_4_CCER*)(TIM3_BASE+0X20))

#define TIM3_CNT		((MM32_TIM_3_4_CNT*)(TIM3_BASE+0X24))

#define TIM3_PSC		((MM32_TIM_3_4_PSC*)(TIM3_BASE+0X28))

#define TIM3_ARR		((MM32_TIM_3_4_ARR*)(TIM3_BASE+0X2C))

#define TIM3_CCR1		((MM32_TIM_3_4_CCR1*)(TIM3_BASE+0X34))

#define TIM3_CCR2		((MM32_TIM_3_4_CCR2*)(TIM3_BASE+0X38))

#define TIM3_CCR3		((MM32_TIM_3_4_CCR3*)(TIM3_BASE+0X3C))

#define TIM3_CCR4		((MM32_TIM_3_4_CCR4*)(TIM3_BASE+0X40))

#define TIM3_DCR		((MM32_TIM_3_4_DCR*)(TIM3_BASE+0X48))

#define TIM3_DMAR		((MM32_TIM_3_4_DMAR*)(TIM3_BASE+0X4C))

#define TIM4_CR1		((MM32_TIM_3_4_CR1*)(TIM4_BASE+0X00))

#define TIM4_CR2		((MM32_TIM_3_4_CR2*)(TIM4_BASE+0X04))

#define TIM4_SMCR		((MM32_TIM_3_4_SMCR*)(TIM4_BASE+0X08))

#define TIM4_DIER		((MM32_TIM_3_4_DIER*)(TIM4_BASE+0X0C))

#define TIM4_SR		((MM32_TIM_3_4_SR*)(TIM4_BASE+0X10))

#define TIM4_EGR		((MM32_TIM_3_4_EGR*)(TIM4_BASE+0X14))

#define TIM4_CCMR1		((MM32_TIM_3_4_CCMR1*)(TIM4_BASE+0X18))

#define TIM4_CCMR2		((MM32_TIM_3_4_CCMR2*)(TIM4_BASE+0X1C))

#define TIM4_CCER		((MM32_TIM_3_4_CCER*)(TIM4_BASE+0X20))

#define TIM4_CNT		((MM32_TIM_3_4_CNT*)(TIM4_BASE+0X24))

#define TIM4_PSC		((MM32_TIM_3_4_PSC*)(TIM4_BASE+0X28))

#define TIM4_ARR		((MM32_TIM_3_4_ARR*)(TIM4_BASE+0X2C))

#define TIM4_CCR1		((MM32_TIM_3_4_CCR1*)(TIM4_BASE+0X34))

#define TIM4_CCR2		((MM32_TIM_3_4_CCR2*)(TIM4_BASE+0X38))

#define TIM4_CCR3		((MM32_TIM_3_4_CCR3*)(TIM4_BASE+0X3C))

#define TIM4_CCR4		((MM32_TIM_3_4_CCR4*)(TIM4_BASE+0X40))

#define TIM4_DCR		((MM32_TIM_3_4_DCR*)(TIM4_BASE+0X48))

#define TIM4_DMAR		((MM32_TIM_3_4_DMAR*)(TIM4_BASE+0X4C))

#endif